MakeSense-Lab/MakeSense-Lab_Controllers-v1.3.0/boards.txt
##############################################################

OrbitCore_Board.name=OrbitCore

OrbitCore_Board.upload.tool=avrdude
OrbitCore.upload.protocol=arduino
OrbitCore.upload.maximum_size=32256
OrbitCore.upload.maximum_data_size=2048
OrbitCore.upload.speed=115200

OrbitCore.bootloader.tool=avrdude
OrbitCore.bootloader.low_fuses=0xFF
OrbitCore.bootloader.high_fuses=0xDE
OrbitCore.bootloader.extended_fuses=0xFD
OrbitCore.bootloader.unlock_bits=0x3F
OrbitCore.bootloader.lock_bits=0x0F
OrbitCore.bootloader.file=optiboot/optiboot_atmega328.hex

OrbitCore.build.mcu=atmega328p
OrbitCore.build.f_cpu=16000000L
OrbitCore.build.board=ONYX_BOARD
OrbitCore.build.core=arduino
OrbitCore.build.variant=standard

##############################################################
